testing_scripts/first_test_result/k6_test_log.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

ERRO[0000] The moduleSpecifier "stress/k6Test.js" couldn't be found on local disk. Make sure that you've specified the right path to the file. If you're running k6 using the Docker image make sure you have mounted the local directory (-v /local/path/:/inside/docker/path) containing your script and modules so that they're accessible by k6 from inside of the container, see https://grafana.com/docs/k6/latest/using-k6/modules/#using-local-modules-with-docker.

C:\Users\Think\Desktop\SofEng-Tests\testing_scripts>k6 run k6Test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: k6Test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1m40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     data_received..............: 919 kB  9.1 kB/s
     data_sent..................: 195 kB  1.9 kB/s
     http_req_blocked...........: avg=58.68µs  min=0s     med=0s       max=8.18ms  p(90)=0s     p(95)=0s
     http_req_connecting........: avg=37.07µs  min=0s     med=0s       max=3.02ms  p(90)=0s     p(95)=0s
     http_req_duration..........: avg=3.04ms   min=0s     med=3.01ms   max=31.67ms p(90)=4.71ms p(95)=6.09ms
     http_req_failed............: 100.00% 2186 out of 2186
     http_req_receiving.........: avg=914.26µs min=0s     med=175.85µs max=12.11ms p(90)=2.53ms p(95)=2.89ms
     http_req_sending...........: avg=42.31µs  min=0s     med=0s       max=7.24ms  p(90)=0s     p(95)=391.6µs
     http_req_tls_handshaking...: avg=0s       min=0s     med=0s       max=0s      p(90)=0s     p(95)=0s
     http_req_waiting...........: avg=2.08ms   min=0s     med=1.39ms   max=25.26ms p(90)=3.79ms p(95)=4.91ms
     http_reqs..................: 2186    21.677621/s
     iteration_duration.........: avg=1s       min=3.17ms med=1s       max=2s      p(90)=1.81s  p(95)=1.89s
     iterations.................: 2186    21.677621/s
     vus........................: 4       min=1            max=49
     vus_max....................: 50      min=50           max=50


running (1m40.8s), 00/50 VUs, 2186 complete and 0 interrupted iterations
default ✓ [======================================] 00/50 VUs  1m40s